performance-tests/jmeter/results/diagnostic-frontend-host-20260909-224426/html-report/statistics.json
{
  "POST /api/v1/auth/login" : {
    "transaction" : "POST /api/v1/auth/login",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 907.0,
    "medianResTime" : 907.0,
    "minResTime" : 907.0,
    "maxResTime" : 907.0,
    "pct1ResTime" : 907.0,
    "pct2ResTime" : 907.0,
    "pct3ResTime" : 907.0,
    "throughput" : 1.1025358324145536,
    "receivedKBytesPerSec" : 0.3833034729878721,
    "sentKBytesPerSec" : 0.28747760474090406
  },
  "Authenticated project read journey" : {
    "transaction" : "Authenticated project read journey",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 4348.0,
    "medianResTime" : 4348.0,
    "minResTime" : 4348.0,
    "maxResTime" : 4348.0,
    "pct1ResTime" : 4348.0,
    "pct2ResTime" : 4348.0,
    "pct3ResTime" : 4348.0,
    "throughput" : 0.22999080036798528,
    "receivedKBytesPerSec" : 0.3553178185372585,
    "sentKBytesPerSec" : 0.0918615599126035
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3,
    "errorCount" : 3,
    "errorPct" : 100.0,
    "meanResTime" : 507.3333333333333,
    "medianResTime" : 389.0,
    "minResTime" : 226.0,
    "maxResTime" : 907.0,
    "pct1ResTime" : 907.0,
    "pct2ResTime" : 907.0,
    "pct3ResTime" : 907.0,
    "throughput" : 0.5688282138794084,
    "receivedKBytesPerSec" : 0.35885061149032993,
    "sentKBytesPerSec" : 0.12517183352294273
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 1765.0,
    "medianResTime" : 1765.0,
    "minResTime" : 1765.0,
    "maxResTime" : 1765.0,
    "pct1ResTime" : 1765.0,
    "pct2ResTime" : 1765.0,
    "pct3ResTime" : 1765.0,
    "throughput" : 0.56657223796034,
    "receivedKBytesPerSec" : 0.19697237960339944,
    "sentKBytesPerSec" : 0.1477292847025496
  },
  "GET /api/v1/projects" : {
    "transaction" : "GET /api/v1/projects",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 389.0,
    "medianResTime" : 389.0,
    "minResTime" : 389.0,
    "maxResTime" : 389.0,
    "pct1ResTime" : 389.0,
    "pct2ResTime" : 389.0,
    "pct3ResTime" : 389.0,
    "throughput" : 2.5706940874035986,
    "receivedKBytesPerSec" : 1.985760764781491,
    "sentKBytesPerSec" : 0.5146409061696658
  },
  "GET /api/v1/auth/me" : {
    "transaction" : "GET /api/v1/auth/me",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 226.0,
    "medianResTime" : 226.0,
    "minResTime" : 226.0,
    "maxResTime" : 226.0,
    "pct1ResTime" : 226.0,
    "pct2ResTime" : 226.0,
    "pct3ResTime" : 226.0,
    "throughput" : 4.424778761061947,
    "receivedKBytesPerSec" : 3.41796875,
    "sentKBytesPerSec" : 0.8814988938053097
  }
}